20190130-rails-homework/rails_homework_11b_05/app/controllers/attendances_controller.rb

INSERT INTO "attendances" ("created_at", "updated_at", "person_id", "event_id") VALUES (?, ?, ?, ?)  [["created_at", "2019-01-25 13:02:56.692854"], ["updated_at", "2019-01-25 13:02:56.692854"], ["person_id", 1], ["event_id", 1]]
---
	def create
		@attendance = Attendance.new :person_id => params[:person_id], :event_id => params[:attendance][:event_id]
		if @attendance.save

DELETE FROM "attendances" WHERE "attendances"."id" = ?  [["id", 6]]
SELECT  "attendances".* FROM "attendances" WHERE "attendances"."person_id" = ? AND "attendances"."event_id" = ? LIMIT ?  [["person_id", 1], ["event_id", 2], ["LIMIT", 1]]
---
	def destroy
		person_id = params[:person_id]
		Attendance.find_by(person_id: params[:person_id], event_id: params[:event_id]).delete