20190130-rails-homework/rails_homework_11b_05/app/controllers/people_controller.rb

SELECT "events".* FROM "events" INNER JOIN "attendances" ON "events"."id" = "attendances"."event_id" WHERE "attendances"."person_id" = ?  [["person_id", 1]]
---
  def show
	@events = Person.find(params[:id]).events()
	@other_events = Event.all - Person.find(params[:id]).events