20190130-rails-homework/rails_homework_11b_11/app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("name", "location", "description", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)