20190130-rails-homework/rails_homework_11b_11/app/controllers/people_controller.rb

INSERT INTO "attendances" ("person_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["person_id", 3], ["event_id", 1], ["created_at", "2019-01-26 12:39:41.210019"], ["updated_at", "2019-01-26 12:39:41.210019"]]
---
  def subscribe
	  attendance = Attendance.new(attendance_params)
	  if attendance.save

DELETE FROM "attendances" WHERE "attendances"."id" = ?  [["id", 3]]
SELECT  "attendances".* FROM "attendances" WHERE "attendances"."person_id" = ? AND "attendances"."event_id" = ? LIMIT ?  [["person_id", 3], ["event_id", 1], ["LIMIT", 1]]
---
  def unsubscribe
	  Attendance.find_by(person_id: params[:id], event_id: params[:event_id]).destroy

SELECT "events".* FROM "events"
SELECT  1 AS one FROM "events" INNER JOIN "attendances" ON "events"."id" = "attendances"."event_id" WHERE "attendances"."person_id" = ? AND "events"."id" = ? LIMIT ?  [["person_id", 3], ["id", 1], ["LIMIT", 1]]
---
  def show
    @person = Person.find(params[:id])
    @subscribed_events = @person.events
    @not_subscribed_events = Event.all.select { |event|
	!@subscribed_events.include?(event)