20190130-rails-homework/rails_homework_11b_13/app/views/people/show.html.erb

SELECT "organizations".* FROM "organizations"
---
	  <div class = "field">
		<%= form.select :organization_id, options_for_select(Organization.all.map{|org|[org.name, org.id]}) %>