11b_04_Antonii_Zlatarov/app/controllers/documents_controller.rb

	def edit
		@document = Document.find(params[:id])
---
SELECT  "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

	def index
		@documents = Document.last(3)
---
SELECT  "documents".* FROM "documents" ORDER BY "documents"."id" DESC LIMIT ?  [["LIMIT", 3]]

	def create
		@document = Document.new(doc_params)
		if @document.save
---
INSERT INTO "documents" ("name", "description", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Document number 1"], ["description", "Some desc"], ["content", "Some content"], ["created_at", "2019-01-22 17:42:16.443919"], ["updated_at", "2019-01-22 17:42:16.443919"]]

	def update
		@document = Document.find(params[:id])

		if @document.update(doc_params)
---
SELECT  "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "documents" SET "content" = ?, "updated_at" = ? WHERE "documents"."id" = ?  [["content", "xaxaxaxaxaxaxaxa"], ["updated_at", "2019-01-22 17:58:18.217554"], ["id", 3]]

	def destroy
		@document = Document.find(params[:id])
		@document.destroy
---
SELECT  "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "documents" WHERE "documents"."id" = ?  [["id", 1]]

	def show
		@document = Document.find(params[:id])
		if params[:email].blank? && params[:pass].blank?
		elsif user_signed_in?
			if user = User.find_by(email: params[:email])
---
SELECT  "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "a"], ["LIMIT", 1]]