11b_13_Krasimir_Georgiev/app/controllers/documents_controller.rb

  def create
    @document = Document.new(document_params)

    if @document.save
---
INSERT INTO "documents" ("name", "description", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "ASD"], ["description", "123"], ["body", "body\r\n"], ["created_at", "2019-01-20 12:43:52.565824"], ["updated_at", "2019-01-20 12:43:52.565824"]]

  def destroy
    @document.destroy
---
DELETE FROM "documents" WHERE "documents"."id" = $1  [["id", 8]]

    def set_document
      @document = Document.find(params[:id])
---
SELECT  "documents".* FROM "documents" WHERE "documents"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]