11b_13_Krasimir_Georgiev/app/controllers/login_system_controller.rb

  def create
  	user = User.new(
  		params.require(:user).permit(:email, :password)
  	)
  	if user.save
---
INSERT INTO "users" ("email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "email"], ["password", "prasu"], ["created_at", "2019-01-20 01:29:19.458582"], ["updated_at", "2019-01-20 01:29:19.458582"]]

  def login_attempt
  	email = params[:user][:email]
  	password = params[:user][:password]

  	user = User.where(email: email, password: password).first
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 AND "users"."password" = $2 ORDER BY "users"."id" ASC LIMIT $3  [["email", "krasi2405@gmail.com"], ["password", "12345"], ["LIMIT", 1]]