the_project/app/controllers/cats_controller.rb

  def create
    cat = Cat.new(cat_params)
    if cat.save
---
INSERT INTO "cats" ("name", "weight", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Gosho"], ["weight", 12], ["created_at", "2018-11-07 07:14:43.772766"], ["updated_at", "2018-11-07 07:14:43.772766"]]

  def update
    cat = Cat.find(params[:id])
    if cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "name" = ?, "updated_at" = ? WHERE "cats"."id" = ?  [["name", "Jojo2"], ["updated_at", "2018-11-16 06:52:06.439726"], ["id", 9]]

  def destroy
    cat = Cat.find(params[:id])
    cat.destroy
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
DELETE FROM "cats" WHERE "cats"."id" = ?  [["id", 15]]