20190130-rails-homework/rails_homework_11b_13/app/controllers/attendances_controller.rb

	def add
	    attendance = Attendance.new
	    attendance.event = Event.find(params[:event_id])
	    attendance.attendant_id = params[:attendant_id]
		attendance.attendant_type = params[:attendant_type]
	    attendance.save()
---
SELECT  "attendances".* FROM "attendances" WHERE "attendances"."id" = ? LIMIT ?  [["id", 40], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "attendances" ("event_id", "created_at", "updated_at", "attendant_type", "attendant_id") VALUES (?, ?, ?, ?, ?)  [["event_id", 1], ["created_at", "2019-01-25 08:02:51.001998"], ["updated_at", "2019-01-25 08:02:51.001998"], ["attendant_type", "Person"], ["attendant_id", 3]]

	def remove
	    attendance = Attendance.where(
	    	attendant_id: params[:attendant_id],
	    	attendant_type: params[:attendant_type],
	    	event_id: params[:event_id]
	   	).first

	    Attendance.delete(attendance.id)
---
SELECT  "attendances".* FROM "attendances" WHERE "attendances"."attendant_type" = ? AND "attendances"."attendant_id" = ? AND "attendances"."event_id" = ? ORDER BY "attendances"."id" ASC LIMIT ?  [["attendant_type", "Person"], ["attendant_id", 3], ["event_id", 3], ["LIMIT", 1]]
DELETE FROM "attendances" WHERE "attendances"."id" = ?  [["id", 56]]