20190130-rails-homework/rails_homework_11b_13/app/controllers/organizations_controller.rb

SELECT "events".* FROM "events"
---
  def show
    @attendances = @organization.attendances
    @subscribed_events = []
    for attendance in @attendances
      @subscribed_events.append(attendance.event)
    end

    events = Event.all
    @unsubscribed_events = []
    for event in events
      if not @subscribed_events.include?(event)

INSERT INTO "organizations" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "asd"], ["created_at", "2019-01-26 05:24:50.997760"], ["updated_at", "2019-01-26 05:24:50.997760"]]
---
  def create
    @organization = Organization.new(organization_params)

    respond_to do |format|
      if @organization.save

DELETE FROM "organizations" WHERE "organizations"."id" = ?  [["id", 2]]
---
  def destroy
    @organization.destroy