20190130-rails-homework/rails_homework_11b_13/app/controllers/people_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "events".* FROM "events"
---
  def show
    @organization = @person.organization
    @organization_events = []
    if @organization
      for attendance in @organization.attendances
        @organization_events.append(attendance.event)
      end
    end

    attendances = @person.attendances
    @subscribed_events = []
    for attendance in attendances
      if not @organization_events.include?(attendance.event)
        @subscribed_events.append(attendance.event)
      end
    end

    events = Event.all
    @unsubscribed_events = []
    for event in events
      if not @subscribed_events.include?(event) and not @organization_events.include?(event)

SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "people".* FROM "people" WHERE "people"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def join_organization
    organization = Organization.find(params[:organization_id])
    person = Person.find(params[:id])
    person.organization = organization

    if person.save
      redirect_to(controller: "people", action: "show", id: params[:id])
    else
      redirect_to(controller: "people", action: "show", id: params[:id],
        notice: person.errors.full_messages.first)

SELECT  "people".* FROM "people" WHERE "people"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def leave_organization
    person = Person.find(params[:id])
    person.organization = nil
    if person.save
      redirect_back(fallback_location: {controller: "people", action: "show", id: params[:id]})
    else
      redirect_back(fallback_location: {controller: "people", action: "show", id: params[:id]},
        notice: person.errors.full_messages.first)