20190130-rails-homework/rails_homework_11A_06/app/controllers/events_controller.rb

INSERT INTO "events" ("name", "place", "description", "data", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
	def create
		event = Event.new(event_params)
		if event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "events" SET "description" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["description", ""], ["updated_at", "2019-01-24 15:14:24.757079"], ["id", 3]]
---
	def update
		event = Event.find(params[:id])
		if event.update(event_params)

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]
---
	def destroy
		event = Event.find(params[:id])
		event.destroy