20190130-rails-homework/rails_homework_11A_06/app/controllers/organizations_controller.rb

	def create
		organization = Organization.new(organizaton_params)
		if organization.save
---
INSERT INTO "organizations" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "aaa"], ["created_at", "2019-01-24 12:07:28.034448"], ["updated_at", "2019-01-24 12:07:28.034448"]]

	def show
		@organization = Organization.find(params[:id])
		@events_not_attended = Array.new
		@events_attended = Array.new
		Event.find_each do |event|
			if event.organizations.exists?
				if event.organizations.ids.include? @organization.id
---
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "events".* FROM "events" ORDER BY "events"."id" ASC LIMIT ?  [["LIMIT", 1000]]
SELECT "organizations"."id" FROM "organizations" INNER JOIN "attendances" ON "organizations"."id" = "attendances"."organization_id" WHERE "attendances"."event_id" = ?  [["event_id", 1]]
SELECT  1 AS one FROM "organizations" INNER JOIN "attendances" ON "organizations"."id" = "attendances"."organization_id" WHERE "attendances"."event_id" = ? LIMIT ?  [["event_id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "organizations" INNER JOIN "attendances" ON "organizations"."id" = "attendances"."organization_id" WHERE "attendances"."event_id" = ? LIMIT ?  [["event_id", 3], ["LIMIT", 1]]

	def add_event
		organization = Organization.find(params[:organization_id])
		event = Event.find_by(name: params[:event])
		if Attendance.find_by(organization: organization, event: event)
			#do nothing
		else
			Attendance.create(organization: organization, event: event)
---
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."name" = ? LIMIT ?  [["name", "asdasdasd"], ["LIMIT", 1]]
SELECT  "attendances".* FROM "attendances" WHERE "attendances"."organization_id" = ? AND "attendances"."event_id" = ? LIMIT ?  [["organization_id", 4], ["event_id", 1], ["LIMIT", 1]]
INSERT INTO "attendances" ("event_id", "organization_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["event_id", 1], ["organization_id", 1], ["created_at", "2019-01-24 13:32:48.553261"], ["updated_at", "2019-01-24 13:32:48.553261"]]

	def delete_event
		organization = Organization.find(params[:organization_id])
		event = Event.find(params[:event_id])
		if Attendance.find_by(organization: organization, event: event)
			Attendance.find_by(organization: organization, event: event).destroy
---
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "attendances".* FROM "attendances" WHERE "attendances"."organization_id" = ? AND "attendances"."event_id" = ? LIMIT ?  [["organization_id", 2], ["event_id", 1], ["LIMIT", 1]]
DELETE FROM "attendances" WHERE "attendances"."id" = ?  [["id", 3]]