20190130-rails-homework/rails_homework_11A_06/app/controllers/people_controller.rb

	def show
		@person = Person.find(params[:id])
		@events_not_attended = Array.new
		@events_attended = Array.new
		Event.find_each do |event|
			if event.people.exists?
				if event.people.ids.include? @person.id
					@events_attended.push(event)
				else
					@events_not_attended.push(event)
				end
			else
				@events_not_attended.push(event)
			end
		end
		if @person.organization_id != nil
			@organization = Organization.find(@person.organization_id)
---
SELECT  "people".* FROM "people" WHERE "people"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]