20190130-rails-homework/rails_homework_11A_06/app/controllers/people_controller.rb

SELECT  "events".* FROM "events" ORDER BY "events"."id" ASC LIMIT ?  [["LIMIT", 1000]]
SELECT  1 AS one FROM "people" INNER JOIN "attendances" ON "people"."id" = "attendances"."person_id" WHERE "attendances"."event_id" = ? LIMIT ?  [["event_id", 1], ["LIMIT", 1]]
SELECT "people"."id" FROM "people" INNER JOIN "attendances" ON "people"."id" = "attendances"."person_id" WHERE "attendances"."event_id" = ?  [["event_id", 1]]
SELECT  1 AS one FROM "people" INNER JOIN "attendances" ON "people"."id" = "attendances"."person_id" WHERE "attendances"."event_id" = ? LIMIT ?  [["event_id", 3], ["LIMIT", 1]]
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "people".* FROM "people" WHERE "people"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "organizations".* FROM "organizations"
---
	def show
		@person = Person.find(params[:id])
		@events_not_attended = Array.new
		@events_attended = Array.new
		Event.find_each do |event|
			if event.people.exists?
				if event.people.ids.include? @person.id
					@events_attended.push(event)
				else
					@events_not_attended.push(event)
				end
			else
				@events_not_attended.push(event)
			end
		end
		if @person.organization_id != nil
			@organization = Organization.find(@person.organization_id)
		else
			@organizations = Organization.all

SELECT  "events".* FROM "events" WHERE "events"."name" = ? LIMIT ?  [["name", "asdfadasd"], ["LIMIT", 1]]
SELECT  "attendances".* FROM "attendances" WHERE "attendances"."person_id" = ? AND "attendances"."event_id" = ? LIMIT ?  [["person_id", 2], ["event_id", 1], ["LIMIT", 1]]
INSERT INTO "attendances" ("person_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["person_id", 2], ["event_id", 1], ["created_at", "2019-01-24 10:25:35.125299"], ["updated_at", "2019-01-24 10:25:35.125299"]]
---
	def add_event
		person = Person.find(params[:person_id])
		event = Event.find_by(name: params[:event])
		if Attendance.find_by(person: person, event: event)
			#do nothing
		else
			Attendance.create(person: person, event: event)

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "attendances".* FROM "attendances" WHERE "attendances"."person_id" = ? AND "attendances"."event_id" = ? LIMIT ?  [["person_id", 1], ["event_id", 1], ["LIMIT", 1]]
DELETE FROM "attendances" WHERE "attendances"."id" = ?  [["id", 4]]
---
	def delete_event
		person = Person.find(params[:person_id])
		event = Event.find(params[:event_id])
		if Attendance.find_by(person: person, event: event)
			Attendance.find_by(person: person, event: event).destroy

SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def add_organization
		person = Person.find(params[:person_id])
		organization = Organization.find(params[:organization_id])

SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def leave_organization
		person = Person.find(params[:person_id])
		organization = Organization.find(params[:organization_id])