c_january/11A_12_Ivailo_Georgiev/app/controllers/documents_controller.rb

SELECT  "documents".* FROM "documents" ORDER BY id desc LIMIT ?  [["LIMIT", 3]]
---
	def startpage
		@documents = Document.all.order("id desc").limit(3)

SELECT  "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
	def show
		@document = Document.find(params[:id])

INSERT INTO "documents" ("name", "desc", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "exo"], ["desc", "az sum"], ["text", "da be"], ["created_at", "2019-01-22 20:23:49.364465"], ["updated_at", "2019-01-22 20:23:49.364465"]]
---
	def create
		doc = Document.create(doc_params)