c_january/11b_18_Mihail_Gerginov/app/controllers/documents_controller.rb

INSERT INTO "documents" ("document_name", "description", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @document = Document.new(document_params)
    @document.created_at = Time.new
    respond_to do |format|
      if @document.save

SELECT  "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_document
      @document = Document.find(params[:id])