20190130-rails-homework/rails_homework_11A_06/app/views/people/show.html.erb

SELECT "events".* FROM "events" WHERE (person != 6)
---
<%= form_tag("/people/add_event?person_id=#{@person.id}") do -%>
  <%= select_tag "event", options_for_select(@events_not_attended.map{|e| e.name}) %>

SELECT "events".* FROM "events" INNER JOIN "attendances" ON "events"."id" = "attendances"."event_id" WHERE "attendances"."organization_id" = ?  [["organization_id", 1]]
---
	<h4>Events of organization:</h4>
	<% @organization.events.each do |e| %>