20190130-rails-homework/rails_homework_11b_23/app/controllers/people_controller.rb

INSERT INTO "attendences" ("person_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["person_id", 1], ["event_id", 1], ["created_at", "2019-01-24 15:40:40.745627"], ["updated_at", "2019-01-24 15:40:40.745627"]]
---
  def attend
    puts "Attending..."
    att = Attendence.new
    att.person_id = params[:id]
    att.event_id = params[:event_id]
    att.save

SELECT  "attendences".* FROM "attendences" WHERE "attendences"."person_id" = ? AND "attendences"."event_id" = ? LIMIT ?  [["person_id", 1], ["event_id", 2], ["LIMIT", 1]]
DELETE FROM "attendences" WHERE "attendences"."id" = ?  [["id", 5]]
---
  def cancel
    puts "Canceling event..."
    at = Attendence.find_by(person_id: params[:id], event_id: params[:event_id])
    at.destroy

SELECT "events".* FROM "events"
SELECT  1 AS one FROM "events" INNER JOIN "attendences" ON "events"."id" = "attendences"."event_id" WHERE "attendences"."person_id" = ? AND "events"."id" = ? LIMIT ?  [["person_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def show
    @person_events = @person.events
    @other_events = Array.new
    for event in Event.all
       if(!@person_events.include?(event))