20190130-rails-homework/rails_homework_11b_02/app/views/people/show.html.erb

SELECT  "attendances".* FROM "attendances" WHERE "attendances"."person_id" = ? AND "attendances"."event_id" = ? LIMIT ?  [["person_id", 2], ["event_id", 2], ["LIMIT", 1]]
---
  <p><%= event.date %></p>
  <% if Attendance.find_by(person_id: @person.id, event_id: event.id) == nil %>