20190130-rails-homework/rails_homework_11b_02/app/controllers/attendances_controller.rb

INSERT INTO "attendances" ("person_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["person_id", 2], ["event_id", 2], ["created_at", "2019-01-25 11:21:27.243209"], ["updated_at", "2019-01-25 11:21:27.243209"]]
---
  def create
    @attendance = Attendance.new(attendance_params)
	if @attendance.save

DELETE FROM "attendances" WHERE "attendances"."id" = ?  [["id", 1]]
---
  def delete
    person = @attendance.person
	@attendance.destroy