20190130-rails-homework/rails_homework_11b_02/app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("name", "location", "description", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "tosho"], ["location", "nz"], ["description", "gn"], ["date", "2019-01-27 18:49:00"], ["created_at", "2019-01-23 17:49:58.360714"], ["updated_at", "2019-01-23 17:49:58.360714"]]

  def update
    respond_to do |format|
      if @event.update(event_params)
---
UPDATE "events" SET "description" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["description", "eweqwdasdadq wqffgiabgrueabv;aouebv;oraubvrbvoaeurvb ella"], ["updated_at", "2019-01-23 18:48:21.032336"], ["id", 2]]