20190130-rails-homework/rails_homework_11b_02/app/controllers/people_controller.rb

  def show
	@events = Event.all
---
SELECT "events".* FROM "events"